ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_tdm.h
/***************************************************************************//**
* \file cy_tdm.h
* \version 1.0
*
* \brief
* The header file of the Audio TDM driver.
*
********************************************************************************
* \copyright
* Copyright 2016-2019 Cypress Semiconductor Corporation
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_tdm
* \{
* Configures audio TDM/I2S.
*
* The functions and other declarations used in this driver are in cy_tdm.h. 
* You can include cy_pdl.h (ModusToolbox only) to get access to all functions 
* and declarations in the PDL.
*
*
* Features:
* * Supports I2S mode and TDM mode.
* * Master and slave functionality.
* * Full-duplex transmitter and receiver operation.
* * Support for up to 32 channels.
* * Programmable channel size (up to 32 bits)
* * Programmable channel delay of 0 or 1 bit.
* * Delayed sampling support.
* * Programmable PCM sample formatting (8, 10, 12, 14, 16, 18, 20, 24, 32 bits).
* * Programmable synchronization pulse type.
* * Left-aligned and right-aligned sample formatting.
* * 128 entry TX FIFO with interrupt and trigger support.
* * 128 entry RX FIFO with interrupt and trigger support.
*
* \section group_tdm_configuration Configuration Considerations
*
* To set up a TDM driver, iInitializes the TDM Transmitter module in accordance with a configuration structure.
* 
* * Each TDM/I2S (TX, RX) pair consists of a TDM/I2S transmitter and a TDM/I2S receiver. 
* * The transmitter and receiver can function simultaneously and have dedicated clock control. 
* * The transmitter and receiver have dedicated MMIO registers and a dedicated FIFO. 
* * The transmitter and receiver have a dedicated FIFO interrupt and FIFO trigger. 
* * The transmitter trigger is activated when a programmable number of PCM data slots is available in the TX FIFO. 
* * The receiver trigger is activated when a programmable number of PCM data words is received into the RX FIFO.
*    
* 
* \section group_tdm_more_information More Information.
* See: the TDM chapter of the device technical reference manual (TRM);
*      the TDM Component datasheet;
*
*
* \section group_tdm_MISRA MISRA-C Compliance
* The TDM driver has the following specific deviations:
*
* <table class="doxtable">
*   <tr>
*     <th>MISRA Rule</th>
*     <th>Rule Class (Required/Advisory)</th>
*     <th>Rule Description</th>
*     <th>Description of Deviation(s)</th>
*   </tr>
*   <tr>
*     <td>10.3</td>
*     <td>R</td>
*     <td>A composite expression of the "essentially unsigned" type is being
*         cast to a different type category.</td>
*     <td>The value got from the bitfield physically cannot exceed the enumeration
*         that describes this bitfield. So, the code is safe by design.</td>
*   </tr>
*   <tr>
*     <td>11.4</td>
*     <td>A</td>
*     <td>A cast should not be performed between a pointer to object type and
*         a different pointer to object type.</td>
*   </tr>
*   <tr>
*     <td>20.3</td>
*     <td>R</td>
*     <td>The validity of values passed to library functions shall be checked.</td>
*     <td>This violation is not caused by code changes, i.e. is not a regression.</td>
*   </tr>
* </table>
*
* \section group_tdm_changelog Changelog
*
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td>1.0</td>
*     <td>Initial version</td>
*     <td></td>
*   </tr>
* </table>
*

* \defgroup group_tdm_i2s_macros_intrerrupt_masks Interrupt Masks
* \defgroup group_tdm_data_structures Data Structures
* \defgroup group_tdm_enums Enumerated Types
* \defgroup group_tdm_macros Macros
* \defgroup group_tdm_functions Functions

*/

#if !defined (CY_TDM_H)
#define CY_TDM_H

#include "cy_device.h"

#if defined (CY_IP_MXTDM)

#include "cy_syslib.h"
#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>

#if defined(__cplusplus)
extern "C" {
#endif

/******************************************************************************
 * Macro definitions                                                          *
 ******************************************************************************/

/**
* \addtogroup group_tdm_macros
* \{
*/

/** The driver major version */
#define CY_I2S_DRV_VERSION_MAJOR       1

/** The driver minor version */
#define CY_I2S_DRV_VERSION_MINOR       0

/** The TDM driver identifier */
#define CY_TDM_ID                      (CY_PDL_DRV_ID(0x50U))

/** \} group_tdm_macros */

/**
* \addtogroup group_tdm_i2s_macros_intrerrupt_masks
* \{
*/

/** Bit 0: Less entries in the TX FIFO than specified by Trigger Level. */
#define CY_TDM_INTR_TX_FIFO_TRIGGER         (TDM_TDM_STRUCT_TDM_TX_STRUCT_INTR_TX_FIFO_TRIGGER_Msk)
/** Bit 1: Attempt to write to a full TX FIFO. */
#define CY_TDM_INTR_TX_FIFO_OVERFLOW        (TDM_TDM_STRUCT_TDM_TX_STRUCT_INTR_TX_FIFO_OVERFLOW_Msk)
/** Bit 2: Attempt to read from an empty TX FIFO. */
#define CY_TDM_INTR_TX_FIFO_UNDERFLOW       (TDM_TDM_STRUCT_TDM_TX_STRUCT_INTR_TX_FIFO_UNDERFLOW_Msk)
/** Bit 8: Interface frequency is higher than PCM sample frequency. */
#define CY_TDM_INTR_TX_IF_UNDERFLOW         (TDM_TDM_STRUCT_TDM_TX_STRUCT_INTR_TX_IF_UNDERFLOW_Msk)

/** Bit 0: Less entries in the RX FIFO than specified by Trigger Level. */
#define CY_TDM_INTR_RX_FIFO_TRIGGER         (TDM_TDM_STRUCT_TDM_RX_STRUCT_INTR_RX_FIFO_TRIGGER_Msk)
/** Bit 1: Attempt to write to a full RX FIFO. */
#define CY_TDM_INTR_RX_FIFO_OVERFLOW        (TDM_TDM_STRUCT_TDM_RX_STRUCT_INTR_RX_FIFO_OVERFLOW_Msk)
/** Bit 2: Attempt to read from an empty RX FIFO. */
#define CY_TDM_INTR_RX_FIFO_UNDERFLOW       (TDM_TDM_STRUCT_TDM_RX_STRUCT_INTR_RX_FIFO_UNDERFLOW_Msk)
/** Bit 8: Interface frequency is higher than PCM sample frequency. */
#define CY_TDM_INTR_RX_IF_UNDERFLOW         (TDM_TDM_STRUCT_TDM_RX_STRUCT_INTR_RX_IF_OVERFLOW_Msk)

/** \} group_tdm_i2s_macros_intrerrupt_masks */


/**
* \addtogroup group_tdm_enums
* \{
*/

/** cy_en_tdm_ws_t */
typedef enum
{
    CY_TDM_SIZE_8           = 0U, /**< PCM word size:8bit.  */
    CY_TDM_SIZE_10          = 1U, /**< PCM word size:10bit. */
    CY_TDM_SIZE_12          = 2U, /**< PCM word size:12bit. */
    CY_TDM_SIZE_14          = 3U, /**< PCM word size:14bit. */
    CY_TDM_SIZE_16          = 4U, /**< PCM word size:16bit. */
    CY_TDM_SIZE_18          = 5U, /**< PCM word size:18bit. */
    CY_TDM_SIZE_20          = 6U, /**< PCM word size:20bit. */
    CY_TDM_SIZE_24          = 7U, /**< PCM word size:24bit. */
    CY_TDM_SIZE_32          = 8U  /**< PCM word size:32bit. */
} cy_en_tdm_ws_t;

/** cy_en_tdm_format_t */
typedef enum
{
    CY_TDM_LEFT_DELATED     = 0, /**< Format is left aligned and delayed. */
    CY_TDM_LEFT             = 1, /**< Format is left aligned. */
    CY_TDM_RIGHT_DELATED    = 2, /**< Format is right aligned and delayed. */
    CY_TDM_RIGHT            = 3  /**< Format is right aligned. */
} cy_en_tdm_format_t;

/** cy_en_tdm_device_cfg_t */
typedef enum
{
    CY_TDM_DEVICE_SLAVE     = 0U, /**< Device is configured as slave. */
    CY_TDM_DEVICE_MASTER    = 1U  /**< Device is configured as master. */
} cy_en_tdm_device_cfg_t;

/** cy_en_tdm_word_extend_cfg_t */
typedef enum
{
    CY_ZERO_EXTEND      = 0U,    /**< Zero extended. */
    CY_SIGN_EXTEND      = 1U    /**< sign extended. */
} cy_en_tdm_word_extend_cfg_t;

/** cy_en_tdm_clock_sel_t */
typedef enum
{
    CY_TDM_SEL_SRSS_CLK0    = 0U, /**< Interface clock is selected as clk_if_srss[0]. */
    CY_TDM_SEL_SRSS_CLK1    = 1U, /**< Interface clock is selected as clk_if_srss[1]. */
    CY_TDM_SEL_SRSS_CLK2    = 2U, /**< Interface clock is selected as clk_if_srss[2]. */
    CY_TDM_SEL_SRSS_CLK3    = 3U, /**< Interface clock is selected as clk_if_srss[3]. */
    CY_TDM_SEL_TX_MCLK_IN   = 4U /**< Interface clock is selected as tdm_tx_mclk_in. */
} cy_en_tdm_clock_sel_t;

/** cy_en_tdm_sckpolarity_t */
typedef enum 
{
    CY_TDM_CLK              = 0U, /**< TDM Clock is used as is. */
    CY_TDM_CLK_INVERTED     = 1U  /**< TDM Clock is inverted. */
} cy_en_tdm_sckpolarity_t;

