ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_tdm.h
/** cy_en_tdm_fsyncpolarity_t*/
typedef enum 
{
    CY_TDM_SIGN             = 0U, /**< TDM Sign is used as is. */
    CY_TDM_SIGN_INVERTED    = 1U  /**< TDM Sign is inverted. */
} cy_en_tdm_fsyncpolarity_t;

/** cy_en_tdm_fsyncformat_t */
typedef enum 
{
    CY_TDM_BIT_PERIOD       = 0U, /**< TDM Channel synchronizarion is duration of a bit period. */
    CY_TDM_CH_PERIOD        = 1U  /**< TDM Channel synchronizarion is duration of a channel period. */
} cy_en_tdm_fsyncformat_t;

/**
* TDM status definitions.
*/
typedef enum 
{
    CY_TDM_SUCCESS          = 0x00UL,                                     /**< Successful. */
    CY_TDM_BAD_PARAM        = CY_TDM_ID | CY_PDL_STATUS_ERROR | 0x01UL  /**< One or more invalid parameters. */
} cy_en_tdm_status_t;

/** cy_en_tdm_source_status_t */
typedef enum 
{
    CY_TDM_OK                = 0x00UL, /**< Successful. */
    CY_TDM_BAD               = 0x01UL  /**< Not Good    */
} cy_en_tdm_source_status_t;

/** \} group_tdm_enums */

/**
* \addtogroup group_tdm_data_structures
* \{
*/
/** TDM Initialization configuration. */
typedef struct
{
    bool                        enable;               /**<  Enable TDM TX : true: "Enable" false: "Disable" */
    cy_en_tdm_device_cfg_t      masterMode;           /**<  see #cy_en_tdm_device_cfg_t */
    cy_en_tdm_ws_t              wordSize;             /**<  TX word length. Channel size must be greater or equal to the word size.*/
    cy_en_tdm_format_t          format;               /**<  TX data format, see: #cy_en_tdm_format_t. */
    uint16_t                    clkDiv;               /**<  CLOCK_DIV should be set to an odd value ({1, 3, 5, ..., 255}), to ensure a 50/50% duty cycle  clock.
                                                          *      Only for Master Mode */
    cy_en_tdm_clock_sel_t       clkSel;               /**<  Interface clock "clk_if" selection, see#cy_en_tdm_clock_sel_t. */
    cy_en_tdm_sckpolarity_t     sckPolarity;          /**<  TX clock polarity, 0 for as is and 1 for inverted. */
    cy_en_tdm_fsyncpolarity_t   fsyncPolarity;        /**<  Channel synchronization polarity:'false':used "as is". 'true': inverted. */
    cy_en_tdm_fsyncformat_t     fsyncFormat;          /**<  Channel synchronization pulse format:
                                                          *      '1': Duration of a single bit period.'0': Duration of the first channel.*/
    uint8_t                     channelNUM;           /**<  Number of channels in the frame:
                                                          *     "0": Undefined/illegal."1": 2 channels."2": 3 channels...."31":32 channels
                                                          *      Note: the field value chould be less than CH_NR (the number of support channels).
                                                          *   Note: the TX_CH_CTL.CH_EN fields can be used to enable/disable indvidual channels. */
    uint8_t                     channelSize;          /**<  Channel size:"0": 1 bit."1": 2 bits..."31": 32 bits.
                                                          *      Note: channel size must be greater or equal to the word size. */
    uint8_t                     fifoTriggerLevel;     /**<  Trigger level. When the TX FIFO has less entries than the number of this field,
                                                          *      a transmitter trigger event is generated. */
    uint32_t                    chEN;                 /**<  Channel enable. */
    uint32_t                    signalInput;          /**<  Controls routing to the TX slave signalling inputs (FSYNC/SCK):
                                                              '0': TX slave signaling indipendent from RX signaling:
                                                              '1': TX slave signalling inputs driven by RX Slave:
                                                              '2': TX slave signalling inputs driven by RX Master: */
    bool                        i2sMode;              /**<  IF set to 1 the IP is configured for I2S mode else for TDM mode    */
}cy_stc_tdm_config_tx_t;

/** cy_stc_tdm_config_rx_t */
typedef struct
{
    bool                        enable;               /**<  Enable TDM RX : true: "Enable" false: "Disable" */
    cy_en_tdm_device_cfg_t      masterMode;           /**<  see#cy_en_tdm_device_cfg_t */
    cy_en_tdm_ws_t              wordSize;             /**<  RX word length. Channel size must be greater or equal to the word size.*/
    cy_en_tdm_word_extend_cfg_t signExtend;           /**<  Word extension */
    cy_en_tdm_format_t          format;               /**<  RX data format, see: #cy_en_tdm_format_t. */
    uint16_t                    clkDiv;               /**<  CLOCK_DIV should be set to an odd value ({1, 3, 5, ..., 255}), to ensure a 50/50% duty cycle  clock.
                                                          *   Only for Master Mode */
    cy_en_tdm_clock_sel_t       clkSel;               /**<  Interface clock "clk_if" selection, see#cy_en_tdm_clock_sel_t. */
    cy_en_tdm_sckpolarity_t     sckPolarity;          /**<  RX clock polarity, 0 for as is and 1 for inverted. */
    cy_en_tdm_fsyncpolarity_t   fsyncPolarity;        /**<  Channel synchronization polarity:'false':used "as is". 'true': inverted. */
    bool                        lateSample;           /**<  Interface late sample sample delay.
                                                          *   Slave configuration: "false": Sample PCM bit value on rising edge or falling edge of receiver "rx_sck_in
                                                          *   "true" : Sample PCM bit value on falling edge or rising edge of receiver "rx_sck_in" (half a cycle delay).
                                                          *   Master configuratio: "false": Sample PCM bit value on rising edge or falling edge of receiver "rx_sck_out".
                                                          *   "ture" : Sample PCM bit value on falling edge or rising edge of receiver "rx_sck_out" (half a cycle delay). */
                                                        /**<  RISING = 0  FALLING = 1 */
    cy_en_tdm_fsyncformat_t     fsyncFormat;          /**<  Channel synchronization pulse format:
                                                          *   'false': Duration of a single bit period.'true': Duration of the first channel.*/
    uint8_t                     channelNUM;           /**<  Number of channels in the frame:
                                                          *   "0": Undefined/illegal."1": 2 channels."2": 3 channels...."31":32 channels
                                                          *   Note: the field value chould be less than CH_NR (the number of support channels).
                                                          *   Note: the TX_CH_CTL.CH_EN fields can be used to enable/disable indvidual channels. */
    uint8_t                     channelSize;          /**<  Channel size:"0": 1 bit."1": 2 bits. ..."31": 32 bits.
                                                          *   Note: channel size must be greater or equal to the word size. */
    uint32_t                    chEN;                 /**<  Channel enable. */

