ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_tdm.h
    uint8_t                     fifoTriggerLevel;     /**<  Trigger level. When the RX FIFO has less entries than the number of this field,
                                                          *      a transmitter trigger event is generated. */
    uint32_t                    signalInput;          /**<  Controls routing to the RX slave signalling inputs (FSYNC/SCK):
                                                              '0': RX slave signaling indipendent from TX signaling:
                                                              '1': RX slave signalling inputs driven by TX Slave:
                                                              '2': RX slave signalling inputs driven by TX Master: */
    bool                        i2sMode;              /**<  IF set to 1 the IP is configured for I2S mode else for TDM mode    */
} cy_stc_tdm_config_rx_t;

/** cy_stc_tdm_config_t */
typedef struct
{
    cy_stc_tdm_config_tx_t tx_config;                    /**< TDM Initialization configuration for TX. */
    cy_stc_tdm_config_rx_t rx_config;                    /**< TDM Initialization configuration for RX. */
}cy_stc_tdm_config_t;

/** \} group_tdm_data_structures */

/**
* \addtogroup group_tdm_macros
* \{
*/
/** \cond INTERNAL */
/*******************************************************************************/
/*                               Local definitions                             */
/********************************************************************************/

#define CY_TDM_INTR_TX_MASK            (CY_TDM_INTR_TX_FIFO_TRIGGER     |\
                                        CY_TDM_INTR_TX_FIFO_OVERFLOW    |\
                                        CY_TDM_INTR_TX_FIFO_UNDERFLOW   |\
                                        CY_TDM_INTR_TX_IF_UNDERFLOW)
                                        
                                        
#define CY_TDM_INTR_RX_MASK            (CY_TDM_INTR_RX_FIFO_TRIGGER     |\
                                        CY_TDM_INTR_RX_FIFO_OVERFLOW    |\
                                        CY_TDM_INTR_RX_FIFO_UNDERFLOW   |\
                                        CY_TDM_INTR_RX_IF_UNDERFLOW)


/* Non-zero default values for TX_CTL register */
#define CY_TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_CTL_MS_DEFAULT               (0x1U)  /**<  Default mode is selected as master */

#define CY_TDM_TX_CTL_DEFAULT                                           (_VAL2FLD(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_CTL_MS, CY_TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_CTL_MS_DEFAULT))

/* Non-zero default values for TX_IF_CTL register */
#define CY_TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_IF_CTL_CLOCK_DIV_DEFAULT     (0x7U)  /**< Default clock is clk_if/(CLOCK_DIV+1) */
#define CY_TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_IF_CTL_CLOCK_SEL_DEFAULT     (0x7U)  /**< Default clock is selected as clk_if_srss[0], later it will be off */
#define CY_TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_IF_CTL_CH_SIZE_DEFAULT       (0x1FU) /**< Default channel size is 32 bits */

#define CY_TDM_TX_IF_CTL_DEFAULT               (_VAL2FLD(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_IF_CTL_CLOCK_DIV, CY_TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_IF_CTL_CLOCK_DIV_DEFAULT) | \
                                                _VAL2FLD(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_IF_CTL_CLOCK_SEL, CY_TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_IF_CTL_CLOCK_SEL_DEFAULT) | \
                                                _VAL2FLD(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_IF_CTL_CH_SIZE, CY_TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_IF_CTL_CH_SIZE_DEFAULT))

/* Non-zero default values for RX_CTL register */
#define CY_TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_CTL_WORD_SIGN_EXTEND_DEFAULT (0x1U)  /**< Default rx data word with sign extension */

#define CY_TDM_RX_CTL_DEFAULT                   (_VAL2FLD(TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_CTL_WORD_SIGN_EXTEND, CY_TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_CTL_WORD_SIGN_EXTEND_DEFAULT))


/* Non-zero default values for RX_IF_CTL register */
#define CY_TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_IF_CTL_CLOCK_DIV_DEFAULT     (0x7U)  /**< Default clock is clk_if/(CLOCK_DIV+1) */
#define CY_TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_IF_CTL_CLOCK_SEL_DEFAULT     (0x7U)  /**< Default clock is selected as clk_if_srss[0], later it will be off */
#define CY_TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_IF_CTL_CH_SIZE_DEFAULT       (0x1FU) /**< Default channel size is 32 bits */

#define CY_TDM_RX_IF_CTL_DEFAULT               (_VAL2FLD(TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_IF_CTL_CLOCK_DIV, CY_TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_IF_CTL_CLOCK_DIV_DEFAULT) | \
                                                _VAL2FLD(TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_IF_CTL_CLOCK_SEL, CY_TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_IF_CTL_CLOCK_SEL_DEFAULT) | \
                                                _VAL2FLD(TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_IF_CTL_CH_SIZE, CY_TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_IF_CTL_CH_SIZE_DEFAULT))

/** \endcond */

/** TDM Macro */
#define CY_TDM_IS_CLK_DIV_VALID(clkDiv)      ( ((clkDiv) > 0UL) && ((clkDiv) <= 255U))
/** TDM Macro */
#define CY_TDM_IS_CHANNELS_VALID(channels)   (((channels) > 0UL) && ((channels) <= 31UL))
/** TDM Macro */
#define CY_TDM_IS_CHANNEL_SIZE_VALID(channel_size)   (((channel_size) > 2UL) && ((channel_size) <= 31UL))
/** TDM Macro */
#define CY_I2S_TDM_INTR_TX_MASK_VALID(interrupt) (0UL == ((interrupt) & ((uint32_t) ~CY_TDM_INTR_TX_MASK)))
/** TDM Macro */
#define CY_I2S_TDM_INTR_RX_MASK_VALID(interrupt) (0UL == ((interrupt) & ((uint32_t) ~CY_TDM_INTR_RX_MASK)))
/** TDM Macro */
#define CY_I2S_TDM_IS_INPUT_SIGNAL_MODE_VALID(signalInput)   (signalInput <= 2UL)

/** \} group_tdm_macros */


/**
* \addtogroup group_tdm_functions
* \{
*/
/*******************************************************************************/
/*                      Global initialization functions                        */
/*******************************************************************************/

cy_en_tdm_status_t Cy_AudioTDM_Init( TDM_STRUCT_Type * base, cy_stc_tdm_config_t const * config);
void Cy_AudioTDM_DeInit( TDM_STRUCT_Type * base);


/*****************************************************************************/
/*                      Audio TDM Control and Status                         */
/*****************************************************************************/

__STATIC_INLINE void        Cy_AudioTDM_EnableTx( TDM_TX_STRUCT_Type * base);
__STATIC_INLINE void        Cy_AudioTDM_DisableTx( TDM_TX_STRUCT_Type * base);
__STATIC_INLINE void        Cy_AudioTDM_EnableRx( TDM_RX_STRUCT_Type * base);
__STATIC_INLINE void        Cy_AudioTDM_DisableRx( TDM_RX_STRUCT_Type * base);

