ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/drivers/include/cy_tdm.h
/*******************************************************************************
* Function Name: Cy_AudioTDM_EnableTx
****************************************************************************//**
*
* Starts an I2S/TDM transmission. Interrupt enabling (by the 
* \ref Cy_AudioTDM_SetTxInterrupt) is required after this function call, in case
* if any I2S/TDM interrupts are used in the application.
*
* \pre Cy_AudioTDM_Init() must be called before.
*
* \param base The pointer to the I2S/TDM instance address.
*
*
*******************************************************************************/

__STATIC_INLINE void Cy_AudioTDM_EnableTx( TDM_TX_STRUCT_Type * base)
{
    TDM_STRUCT_TX_CTL(base) |= TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_CTL_ENABLED_Msk;
}

/*******************************************************************************
* Function Name: Cy_AudioTDM_DisableTx
****************************************************************************//**
*
* Stops an I2S/TDM transmission. 
*
* \pre TX interrupt disabling (by the \ref Cy_AudioTDM_SetTxInterrupt) is required
* prior to this function call, in case any TX I2S/TDM interrupts are used.
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/

__STATIC_INLINE void Cy_AudioTDM_DisableTx( TDM_TX_STRUCT_Type * base)
{
    TDM_STRUCT_TX_CTL(base) &= (uint32_t) ~TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_CTL_ENABLED_Msk;
}

/*******************************************************************************
* Function Name: Cy_AudioTDM_EnableRx
****************************************************************************//**
*
* Starts an I2S/TDM transmission. Interrupt enabling (by the 
* \ref Cy_AudioTDM_SetRxInterrupt) is required after this function call, in case
* if any I2S/TDM interrupts are used in the application.
*
* \pre Cy_AudioTDM_Init() must be called before.
*
* \param base The pointer to the I2S/TDM instance address.
*
*
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_EnableRx( TDM_RX_STRUCT_Type * base)
{
    TDM_STRUCT_RX_CTL(base) |= TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_CTL_ENABLED_Msk;
}

/*******************************************************************************
* Function Name: Cy_AudioTDM_DisableRx
****************************************************************************//**
*
* Stops an I2S/TDM transmission. 
*
* \pre TX interrupt disabling (by the \ref Cy_AudioTDM_SetRxInterrupt) is required
* prior to this function call, in case any TX I2S/TDM interrupts are used.
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/

__STATIC_INLINE void Cy_AudioTDM_DisableRx( TDM_RX_STRUCT_Type * base)
{
    TDM_STRUCT_RX_CTL(base) &= (uint32_t) ~TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_CTL_ENABLED_Msk;
}

/*******************************************************************************
* Function Name: Cy_AudioTDM_WriteTxData
****************************************************************************//**
*
* Writes data to the TX FIFO. Increases the TX FIFO level.
*
* \param base The pointer to the I2S/TDM instance address.
*
* \param data Data to be written to the TX FIFO.
*
*******************************************************************************/

__STATIC_INLINE void Cy_AudioTDM_WriteTxData( TDM_TX_STRUCT_Type * base, uint32_t data)
{
    TDM_STRUCT_TX_FIFO_WR(base) = data;
}

/*******************************************************************************
* Function Name: Cy_AudioTDM_FreezeTxFifo
****************************************************************************//**
*
* Freezes the TX FIFO. This function is for debug purposes. output data 0
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_FreezeTxFifo( TDM_TX_STRUCT_Type * base)
{
    TDM_STRUCT_TX_FIFO_CTL(base) &= ~TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_FREEZE_Msk;
    TDM_STRUCT_TX_FIFO_CTL(base) &= ~TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_REPLAY_Msk;
    TDM_STRUCT_TX_FIFO_CTL(base) |= _BOOL2FLD(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_FREEZE, 1u) |
                           _BOOL2FLD(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_REPLAY,  0u);
}

/*******************************************************************************
* Function Name: Cy_AudioTDM_UnfreezeTxFifo
****************************************************************************//**
*
* Unfreezes the TX FIFO. This function is for debug purposes.
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_UnfreezeTxFifo( TDM_TX_STRUCT_Type * base)
{
    TDM_STRUCT_TX_FIFO_CTL(base) &= ~TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_FREEZE_Msk;
    TDM_STRUCT_TX_FIFO_CTL(base) |= _BOOL2FLD(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_FREEZE, 0u);
}
    
/***************************************************************************/
/* Function Name: Cy_AudioTDM_MuteTxFifo                                   */
/***************************************************************************//**
*
* Mutes the TX FIFO. 
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_MuteTxFifo( TDM_TX_STRUCT_Type * base)
{
    TDM_STRUCT_TX_FIFO_CTL(base) &= ~TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_MUTE_Msk;
    TDM_STRUCT_TX_FIFO_CTL(base) |= _BOOL2FLD(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_MUTE, 1u);
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_ActivateTx                                      */
/***************************************************************************//**
*
* Activate/start the TX FIFO. 
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_ActivateTx( TDM_TX_STRUCT_Type * base)
{
    TDM_STRUCT_TX_FIFO_CTL(base) &= ~TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_ACTIVE_Msk;
    TDM_STRUCT_TX_FIFO_CTL(base) |= _BOOL2FLD(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_ACTIVE, 1u);
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_DeActivateTx                                       */
/***************************************************************************//**
*
* Stop the TX FIFO. 
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_DeActivateTx( TDM_TX_STRUCT_Type * base)
{
    TDM_STRUCT_TX_FIFO_CTL(base) &= ~TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_ACTIVE_Msk;
    TDM_STRUCT_TX_FIFO_CTL(base) |= _BOOL2FLD(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_ACTIVE, 0u);
}
/***************************************************************************/
/* Function Name: Cy_AudioTDM_ReplayTxFifo                           */
/***************************************************************************//**
*
* Replay functionality (used when FREEZE is '1' or in case of a FIFO underflow event). 
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/
//data replay
__STATIC_INLINE void Cy_AudioTDM_ReplayTxFifo( TDM_TX_STRUCT_Type * base)
{
    TDM_STRUCT_TX_FIFO_CTL(base) &= ~TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_FREEZE_Msk;
    TDM_STRUCT_TX_FIFO_CTL(base) &= ~TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_REPLAY_Msk;
    TDM_STRUCT_TX_FIFO_CTL(base) |= _BOOL2FLD(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_FREEZE, 1u) |
                           _BOOL2FLD(TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_CTL_REPLAY,  1u);
}
/***************************************************************************/
/* Function Name: Cy_AudioTDM_GetNumInTxFifo                               */
/***************************************************************************//**
*
* Gets the number of used words in the TX FIFO.
*
* \param base The pointer to the I2S/TDM instance address.
*
* \return The current number of used words in the TX FIFO.
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_AudioTDM_GetNumInTxFifo( TDM_TX_STRUCT_Type * base)
{
    return (TDM_STRUCT_TX_FIFO_STATUS(base) & TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_STATUS_USED_Msk);
}
    
/***************************************************************************/
/* Function Name: Cy_AudioTDM_GetTxReadPointer                             */
/***************************************************************************//**
*
* Get the TX FIFO Read Pointer.
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_AudioTDM_GetTxReadPointer( TDM_TX_STRUCT_Type * base) 
{
    return (TDM_STRUCT_TX_FIFO_STATUS(base) & TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_STATUS_RD_PTR_Msk);
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_GetTxWritePointer                            */
/***************************************************************************//**
*
* Get the TX FIFO Write Pointer. 
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_AudioTDM_GetTxWritePointer( TDM_TX_STRUCT_Type * base) 
{
    return (TDM_STRUCT_TX_FIFO_STATUS(base) & TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_FIFO_STATUS_WR_PTR_Msk);
}
/***************************************************************************/
/* Function Name: Cy_AudioTDM_EnableTxTestMode                            */
/***************************************************************************//**
*
* Enables the test mode. Used for debugging purposes only.. 
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_EnableTxTestMode( TDM_TX_STRUCT_Type * base) 
{
    TDM_STRUCT_TX_TEST_CTL(base) |= TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_TEST_CTL_ENABLED_Msk;
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_DisableTxTestMode                            */
/***************************************************************************//**
*
* Disables Test mode. 
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_DisableTxTestMode( TDM_TX_STRUCT_Type * base) 
{
    TDM_STRUCT_TX_TEST_CTL(base) &= (uint32_t) ~TDM_TDM_STRUCT_TDM_TX_STRUCT_TX_TEST_CTL_ENABLED_Msk;
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_ReadRxData                                   */
/***************************************************************************//**
*
* Read Rx data from the Rx FIFO. 
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_AudioTDM_ReadRxData( TDM_RX_STRUCT_Type * base)
{
    return (TDM_STRUCT_RX_FIFO_RD(base));
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_FreezeRxFifo                                 */
/***************************************************************************//**
*
* Freeze RX FIFO. 
* HW writes from the RX FIFO have no effect: freeze will not advance the FIFO write pointer.
* This functionality is intended for debugging purposes.
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_FreezeRxFifo( TDM_RX_STRUCT_Type * base)
{
    TDM_STRUCT_RX_FIFO_CTL(base) &= ~TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_FIFO_CTL_FREEZE_Msk;
    TDM_STRUCT_RX_FIFO_CTL(base) |= _BOOL2FLD(TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_FIFO_CTL_FREEZE, 1u);
}
/***************************************************************************/
/* Function Name: Cy_AudioTDM_UnfreezeRxFifo                               */
/***************************************************************************//**
*
* UnFreeze Rx FIFO. 
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_UnfreezeRxFifo( TDM_RX_STRUCT_Type * base)
{
    TDM_STRUCT_RX_FIFO_CTL(base) &= ~TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_FIFO_CTL_FREEZE_Msk;
    TDM_STRUCT_RX_FIFO_CTL(base) |= _BOOL2FLD(TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_FIFO_CTL_FREEZE, 0u);
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_ActivateRx                                      */
/***************************************************************************//**
*
* Start Rx FIFO. 
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_ActivateRx( TDM_RX_STRUCT_Type * base)
{
    TDM_STRUCT_RX_FIFO_CTL(base) |= TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_FIFO_CTL_ACTIVE_Msk;
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_DeActivateRx                                       */
/***************************************************************************//**
*
* Stop Rx FIFO. 
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_DeActivateRx( TDM_RX_STRUCT_Type * base)
{
    TDM_STRUCT_RX_FIFO_CTL(base) &= ~TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_FIFO_CTL_ACTIVE_Msk;
    TDM_STRUCT_RX_FIFO_CTL(base) |= _BOOL2FLD(TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_FIFO_CTL_ACTIVE, 0u);
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_ReadSilentRXFifo                             */
/***************************************************************************//**
*
* When the RX FIFO is empty, a read from this register returns "0" . 
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_AudioTDM_ReadSilentRXFifo( TDM_RX_STRUCT_Type * base)
{
    return (TDM_STRUCT_RX_FIFO_RD_SILENT(base));
}
/***************************************************************************/
/* Function Name: Cy_AudioTDM_GetNumInRxFifo                               */
/***************************************************************************//**
*
* Reads RX FIFO status
*
* \param base The pointer to the I2S/TDM instance address.
*
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_AudioTDM_GetNumInRxFifo( TDM_RX_STRUCT_Type * base)
{
    return (TDM_STRUCT_RX_FIFO_STATUS(base) & TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_FIFO_STATUS_USED_Msk);
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_GetRxReadPointer                            */
/***************************************************************************//**
*
* Reads RX FIFO Read Pointer
*
* \param base The pointer to the I2S/TDM instance address.
*
* \return The current RX Read pointer value.
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_AudioTDM_GetRxReadPointer( TDM_RX_STRUCT_Type * base)
{
    return (TDM_STRUCT_RX_FIFO_STATUS(base) & TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_FIFO_STATUS_RD_PTR_Msk);
} 

/***************************************************************************/
/* Function Name: Cy_AudioTDM_GetRxWritePointer                            */
/***************************************************************************//**
*
* Reads RX FIFO Write Pointer
*
* \param base The pointer to the I2S/TDM instance address.
*
* \return The current RX Write pointer value.
*
*******************************************************************************/
__STATIC_INLINE uint8_t Cy_AudioTDM_GetRxWritePointer( TDM_RX_STRUCT_Type * base)
{
    return (TDM_STRUCT_RX_FIFO_STATUS(base) & TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_FIFO_STATUS_WR_PTR_Msk);
} 

/***************************************************************************/
/* Function Name: Cy_AudioTDM_EnableRxTestMode                             */
/***************************************************************************//**
*
* Enables Test mode (intended to be used with (master transmitter, slave receiver) configuration).
* Both TX and RX should not be set in Test mode simultaneously.
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_EnableRxTestMode( TDM_RX_STRUCT_Type * base)
{
    TDM_STRUCT_RX_TEST_CTL(base) |= TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_TEST_CTL_ENABLED_Msk;
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_DisableRxTestMode                            */
/***************************************************************************//**
*
* Disable RX test mode
*
* \param base The pointer to the I2S/TDM instance address.
*
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_DisableRxTestMode( TDM_RX_STRUCT_Type * base)
{
    TDM_STRUCT_RX_TEST_CTL(base) &= ~TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_TEST_CTL_ENABLED_Msk;
    TDM_STRUCT_RX_TEST_CTL(base) |= _BOOL2FLD(TDM_TDM_STRUCT_TDM_RX_STRUCT_RX_TEST_CTL_ENABLED, 0u);
}

/***************************************************************************/
/* Function Name: Cy_AudioTDM_ClearTxInterrupt                             */
/***************************************************************************//**
*
* Clear TX interrupt
*
* \param base The pointer to the I2S/TDM instance address.
* \param interrupt interrupt
*
*******************************************************************************/
__STATIC_INLINE void Cy_AudioTDM_ClearTxInterrupt( TDM_TX_STRUCT_Type * base, uint32_t interrupt)
{
    CY_ASSERT_L2(CY_I2S_TDM_INTR_TX_MASK_VALID(interrupt));

